In [1]:
import pandas as pd
import numpy as np

In [6]:
s=pd.Series(np.arange(4),index=['a','b','c','d'])

In [7]:
s

a    0
b    1
c    2
d    3
dtype: int32

In [8]:
s=s*2

In [9]:
s

a    0
b    2
c    4
d    6
dtype: int32

In [10]:
s['a']

0

In [11]:
s[['a','b']]

a    0
b    2
dtype: int32

In [12]:
s[0]

0

In [13]:
s[1:]

b    2
c    4
d    6
dtype: int32

In [14]:
s[s>2]

c    4
d    6
dtype: int32

In [16]:
s[[1,2]]

b    2
c    4
dtype: int32

In [17]:
df=pd.DataFrame(np.arange(25).reshape((5,5)),index=['india','usa','uk','france','london'],
               columns=['A','B','C','D','E'])

In [18]:
df

         A   B   C   D   E
india    0   1   2   3   4
usa      5   6   7   8   9
uk      10  11  12  13  14
france  15  16  17  18  19
london  20  21  22  23  24

In [21]:
df['A']

india      0
usa        5
uk        10
france    15
london    20
Name: A, dtype: int32

In [22]:
df[['A','B']]

         A   B
india    0   1
usa      5   6
uk      10  11
france  15  16
london  20  21

In [23]:
df[df['C']>7]

         A   B   C   D   E
uk      10  11  12  13  14
france  15  16  17  18  19
london  20  21  22  23  24

In [26]:
df.loc['uk']

A    10
B    11
C    12
D    13
E    14
Name: uk, dtype: int32

In [27]:
df.loc[['uk','usa']]

      A   B   C   D   E
uk   10  11  12  13  14
usa   5   6   7   8   9

In [28]:
df>10

            A      B      C      D      E
india   False  False  False  False  False
usa     False  False  False  False  False
uk      False   True   True   True   True
france   True   True   True   True   True
london   True   True   True   True   True